const appTitle = 'Hello Baby';

// const baseUrl = "https://admin.bonum.mn";

// const baseUrl = "http://18.141.10.2:8080";

const baseUrl = "https://services.hellobaby.mn";

const imageUrl = "https://contents.hellobaby.mn/images";

const days = ["Даваа", "Мягмар", "Лхагва", "Пүрэв", "Баасан", "Бямба", "Ням"];

const daysShort = ["Дав", "Мяг", "Лха", "Пүр", "Баа", "Бям", "Ням"];

const List<String> parents = ['Аав', 'Ээж'];

// const List<String> parents = ['Аав', 'Ээж', 'Өвөө', 'Эмээ', 'Ах', 'Эгч', 'Асрагч'];

const List<String> bottleFeedingTypes = ['Хөхний саасан сүү', 'Нэмэлт тэжээл'];

const int CONTENT_PLACE = 5;
const int CONTENT_WEEKLY = 4;
const int CONTENT_VIDEO = 2;
const int CONTENT_POST = 1;
const int CONTENT_PODCAST = 3;

const int CREATE_VIDEO = 0;
const int CREATE_CLASS = 1;
const int CREATE_SUBS = 2;
const int CREATE_E_VIDEO = 3;
const int CREATE_E_CLASS = 4;
const int CREATE_E_SUBS = 5;


const String htmlString = """<h3>Хичээлийн тухай</h3>
    <ul>
    <li>Хүүхдээ асрах цаг зав гарга</li>
<li>Аав хүүхэдтэйгээ хамт байх цаг гаргах</li>
<li>Хүүхдээ асрах хамгийн сайн асаргааг мэдэх</li>
<li>Хүүхэдтэй өдөр бүр ярьж дуулж, уншиж өгөх</li>
<li>Хүүхдэд иллэг массаж хийх нь тайван амрах, унтахад нь илүү тустай байдаг.</li>
</ul>
<h3>Би юу сурах вэ?</h3>
<ul><li>Хүүхдийн зөв хооллолтын тухай суурь болон гүнзгийн ойлголтуудыг мэргэжлийн эмчээс авна.</li>
<li>Өдөр тутмын хүүхдийн зөв хооллолтын үндсийг сурна.</li></ul>
<h3>Агуулга</h3>
<ul><li>Нийт 10 бүлэг хичээл бүхий 4 цагийн хичээл</li></ul>""";


const List<String> cities = [
  "Улаанбаатар",
  "Архангай",
  "Баян-Өлгий",
  "Баянхонгор",
  "Булган",
  "Говь-Алтай",
  "Дорноговь",
  "Дорнод",
  "Дундговь",
  "Завхан",
  "Өвөрхангай",
  "Өмнөговь",
  "Сүхбаатар",
  "Сэлэнгэ",
  "Төв",
  "Увс",
  "Ховд",
  "Хөвсгөл",
  "Хэнтий",
  "Орхон",
  "Дархан-Уул",
  "Говьсүмбэр",
];

const List<String> districts = [
  "Сүхбаатар",
  "Баянзүрх",
  "Чингэлтэй",
  "Налайх",
  "Багануур",
  "Сонгинохайрхан",
  "Хан-Уул",
  "Багахангай",
  "Баянгол",
];



const String firstVaccines = """{
  "id": 1,
  "title": "24 цагийн дотор",
  "childMonth": 0,
  "vaccineOptionsList": [
    {
      "id": 1,
      "title": "Сүрьеэ (БЦЖ) ",
      "title1": "",
      "description": "0-р тун",
      "about": "Дархлаажуулалтын үндэсний товлол гэж улс орны хэмжээнд заавал хийх дархлаажуулалтад хамрагдах хүүхдийн нас, цаг хугацааны товыг хэлнэ. </br></br>Манай улсад заавал хийгдэх дархлаажуулалтыг хүн амд үнэ төлбөргүйгээр явуулдаг ба дархлаажуулалтын үндэсний товлолын дагуу хийдэг байна. Заавал хийгдэх дархлаажуулалтад 10 гаруй өвчнөөс сэргийлэх 6 төрлийн вакцин багтдаг.",
      "vaccine": 1,
      "vaccinated": false
    },
    {
      "id": 2,
      "title": "В Гепатит",
      "title1": "",
      "description": "0-р тун",
      "about": "Дархлаажуулалтын үндэсний товлол гэж улс орны хэмжээнд заавал хийх дархлаажуулалтад хамрагдах хүүхдийн нас, цаг хугацааны товыг хэлнэ. </br></br>Манай улсад заавал хийгдэх дархлаажуулалтыг хүн амд үнэ төлбөргүйгээр явуулдаг ба дархлаажуулалтын үндэсний товлолын дагуу хийдэг байна. Заавал хийгдэх дархлаажуулалтад 10 гаруй өвчнөөс сэргийлэх 6 төрлийн вакцин багтдаг.",
      "vaccine": 1,
      "vaccinated": false
    },
    {
      "modifiedDate": "2021-09-28T11:03:08.571",
      "id": 3,
      "title": "Халдварт саа",
      "title1": "",
      "description": "0-р тун",
      "about": "Дархлаажуулалтын үндэсний товлол гэж улс орны хэмжээнд заавал хийх дархлаажуулалтад хамрагдах хүүхдийн нас, цаг хугацааны товыг хэлнэ. </br></br>Манай улсад заавал хийгдэх дархлаажуулалтыг хүн амд үнэ төлбөргүйгээр явуулдаг ба дархлаажуулалтын үндэсний товлолын дагуу хийдэг байна. Заавал хийгдэх дархлаажуулалтад 10 гаруй өвчнөөс сэргийлэх 6 төрлийн вакцин багтдаг.",
      "vaccine": 1,
      "vaccinated": false
    }
  ]
}""";
